app/controllers/home_controller.rb

  def index
    # Get the three most recent arrest records
    @recent_arrests = Arrest.order( 'date' ).limit( 3 )
---
SELECT `arrests`.* FROM `arrests` ORDER BY date LIMIT 3