app/controllers/user_sessions_controller.rb

  def create
    respond_to do |format|
      @user = User.first #login( params[:username], params[:password] )
---
SELECT `users`.* FROM `users` WHERE (username = 'admin') LIMIT 1